{
  "openings": {
    "letters": ["Hi, ", "I'm Nilson Weng,", "full-stack developer."],
    "typewriter": [
      "Proficient in TypeScript",
      "Specialized in Node.js, React, Next.js",
      "Well-versed in web development"
    ],
    "learnmore": "LEARN MORE"
  },
  "about": {
    "title": "About",
    "texts": [
      "I am a knowledgeable and skilled <b>full-stack web developer</b> with <b>2.5 years</b> of development experience.",
      "Throughout my career, <b>Typescript</b> has been a language that I have consistently used and deeply immersed myself in. I have experience using <b>Angular</b> to build <b>large-scale ERP systems</b> with a team of <b>over 20</b> members. I also used it with <b>Pixi.js</b> and <b>Babylon.js</b> to create <b>2D Canvas</b> and <b>3D WebGL</b> animations",
      "Even in my spare time, I enjoy using <b>TypeScript</b> with <b>Node.js</b>, <b>React</b>, <b>Express</b>, <b>Vite</b>, etc. to explore cutting-edge web technologies. My personal website was also built with it and using <b>Next.js</b> and <b>Tailwind</b>.",
      "I am motivated and eager to learn new technologies. However, I've realized that self-improvement is crucial, but sharing knowledge with others is equally important. For example, in my past work experience, I have shared new dev-tools, such as <b>Prettier</b>, with my team members to improve code quality and readability. In addition, in my personal Discord group, I often serve as the main speaker, and I've already helped <b>two</b> group members get jobs as front-end developers."
    ]
  },
  "experience": {
    "title": "Experience",
    "texts": [
      "I obtained my bachelor's degree in CSIE from Tung-Hai University in Taiwan. Currently, I have accumulated 2.5 years of experience in developing web applications and web servers, having worked on a variety of projects ranging from personal websites and web-based games to large-scale ERP systems for business use."
    ]
  },
  "experience-timeline": [
    {
      "id": "work2",
      "img": "/img/experiences/lattek.jpg",
      "company": "Dah Lih Puh Co., Ltd",
      "jobtitle": "Full Stack Developer",
      "jobposition": "Senior Engineer",
      "location": "Taichung",
      "begintime": [2021, 12],
      "endtime": [2022, 9],
      "texts": [
        "Assist companies in building the next-generation ERP systems.",
        "Help the architect maintain the company's front-end shared modules and version control with GitLab.",
        "Use Prettier and ESLint improve the quality and readability of code",
        "Use Angular (2+) to construct the user interface.",
        "Build RESTful CRUD APIs with ASP.NET Core (3.1+).",
        "Write PL/SQL stored procedures to interact with the Oracle database."
      ]
    },
    {
      "id": "work1",
      "img": "/img/experiences/chungyo.png",
      "company": "La Pluma Fashion Group Co., Ltd",
      "jobtitle": "Game Program Developer",
      "jobposition": "Assistant Engineer",
      "location": "Taichung",
      "begintime": [2019, 10],
      "endtime": [2021, 3],
      "texts": [
        "Develop web-based game projects using Canvas 2D and WebGL.",
        "Maintain the game to run correctly on different browsers and mobile devices.",
        "Use Pixi.js to create 2D games such as slots, little mary slots, and match-3.",
        "Use Babylon.js to create 3D games like Coin Pusher.",
        "Integrate APIs to complete the main game and other payment functions."
      ]
    },
    {
      "id": "university",
      "img": "/img/experiences/thu.png",
      "company": "Tung Hai University",
      "jobtitle": "Computer Science and Information Engineering",
      "jobposition": "Bachelor",
      "location": "Taichung",
      "begintime": [2013, 7],
      "endtime": [2017, 1],
      "texts": [
        "I entered the second year of the CSIE Department as a transfer student from the same college's architecture department."
      ]
    }
  ],
  "skills": {
    "title": "Skills",
    "texts": [
      "Proficient in using <b>TypeScript</b> with other technologies for development.",
      "For the frontend, use <b>React.js</b>, <b>Next.js</b>, and <b>Angular</b> to build web applications. My preferred CSS framework is <b>Tailwind</b>, but I've also utilized <b>Sass</b> and <b>Styled Components</b> in personal projects for managing styles.",
      "For the backend, I have extensive experience with <b>Node.js</b> and a strong understanding of modularization concepts, such as <b>CommonJS</b> and <b>ESM</b> modules. Depending on requirements, I choose the appropriate tools, such as using <b>Vite</b> to develop <b>SPA</b>. <b>Next.js</b> to provide <b>SEO</b> and <b>pre-rendering</b> to speed up FSP for personal websites. <b>Express.js</b> to build web servers, which can handle I/O-intensive tasks and performance bottlenecks caused by high concurrency.",
      "With containerization technology, I'm always using<b> Linux (Debian)</b> and <b>Docker</b>, deploying my applications to cloud platforms like <b>AWS</b>, <b>Vercel</b>, <b>Deno-Deploy</b>, <b>Heroku</b> and <b>Github</b>. And for development, I love using <b>WSL2</b> to make sure my projects run seamlessly in production.",
      "For the database system, use <b>Redis</b> for high-performance caching and real-time streaming, as well as <b>PostgreSQL</b> and <b>MongoDB</b> for high-availability data access and retrieval."
    ]
  },
  "projects": {
    "title": "Experience",
    "texts": ["There are my side projects here."]
  },
  "contact": {
    "title": "Contact",
    "texts": [
      "Currently, I'm looking for a <b>full-stack developer</b> position; <b>remote work is preferred</b>. I'm always up for new challenges and enjoy working with companies or people who share my passion for innovation and creativity. Also, if you have any other question or request, don't hesitate to contact me using the form here!"
    ],
    "fields": {
      "name": "Name",
      "email": "Email",
      "topic": "Topic",
      "message": "Message"
    },
    "topics": {
      "choose": "Choose one",
      "options": [
        {
          "id": "job",
          "text": "Job Invitation"
        },
        {
          "id": "suggest",
          "text": "Give me suggestion"
        },
        {
          "id": "ask",
          "text": "Questions for me?"
        },
        {
          "id": "other",
          "text": "Other"
        }
      ]
    },
    "send": "SEND"
  }
}
